Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF258.PIC
        <edc:SFRDef edc:access="-rrrn-nn" edc:cname="TXB2CON" edc:desc="" edc:impl="0x7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000-00" edc:name="TXB2CON" edc:nzwidth="0x8" edc:por="-0000-00" edc:_addr="0xF20">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB2PRI0" edc:desc="" edc:mask="0x1" edc:name="TXB2PRI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2PRI1" edc:desc="" edc:mask="0x1" edc:name="TXB2PRI1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2REQ" edc:desc="" edc:mask="0x1" edc:name="TXB2REQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2ERR" edc:desc="" edc:mask="0x1" edc:name="TXB2ERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2LARB" edc:desc="" edc:mask="0x1" edc:name="TXB2LARB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2ABT" edc:desc="" edc:mask="0x1" edc:name="TXB2ABT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF21">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB2SID3" edc:desc="" edc:mask="0x1" edc:name="TXB2SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID4" edc:desc="" edc:mask="0x1" edc:name="TXB2SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID5" edc:desc="" edc:mask="0x1" edc:name="TXB2SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID6" edc:desc="" edc:mask="0x1" edc:name="TXB2SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID7" edc:desc="" edc:mask="0x1" edc:name="TXB2SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID8" edc:desc="" edc:mask="0x1" edc:name="TXB2SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID9" edc:desc="" edc:mask="0x1" edc:name="TXB2SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID10" edc:desc="" edc:mask="0x1" edc:name="TXB2SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB2SIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB2SIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF22">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB2EID16" edc:desc="" edc:mask="0x1" edc:name="TXB2EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2EID17" edc:desc="" edc:mask="0x1" edc:name="TXB2EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2EXIDE" edc:desc="" edc:mask="0x1" edc:name="TXB2EXIDE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID0" edc:desc="" edc:mask="0x1" edc:name="TXB2SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID1" edc:desc="" edc:mask="0x1" edc:name="TXB2SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2SID2" edc:desc="" edc:mask="0x1" edc:name="TXB2SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
